--[=======[
-------- -------- -------- --------
  Tencent SSO 2  >>>> CsCmdNo
-------- -------- -------- --------

返回常量表
]=======]
--[[
  CsCmdNo收集由 小秦i@vimer.org(48080163) 提供。特此感谢
]]--
local CsCmdNo =
  {
  [0x0001] = "获取好友分组信息";
  [0x0004] = "配置项开关";
  [0x000D] = "修改在线状态";
  [0x0017] = "收到群/系统消息";
  [0x001D] = "Key查询";
  [0x0027] = "获取在线好友列表";
  [0x003C] = "获取QQ资料";
  [0x0058] = "KeepAlive（心跳）";
  [0x005C] = "获取QQ等级";
  [0x0062] = "退出登陆";
  [0x0067] = "操作签名";
  [0x0081] = "好友在线状态改变";
  [0x0091] = "Ping（服务器探询）";
  [0x00A6] = "天气预报";
  [0x00AA] = "检测是否处于网吧环境";
  [0x00AE] = "Token请求";
  [0x00B7] = "好友验证操作";
  [0x00BA] = "VerifyCode（验证码操作）";
  [0x00CD] = "发送QQ消息";
  [0x00CE] = "收到QQ好友消息";
  [0x00D1] = "Key交互";
  [0x00D4] = "提示文字";
  [0x00DD] = "CheckPwd（验证密码）";
  [0x00DD] = "GetPG（获取密保分量）";
  [0x00DF] = "VerifyPG（验证密保）";
  [0x00E3] = "ExtendData（取扩展数据）";
  [0x00E5] = "GetTGT（取TGT）";
  [0x00EB] = "标记已读消息";
  [0x00EC] = "上线状态";
  [0x0104] = "FetchErrorPrompt（取错误信息）";
  [0x0122] = "获取Host黑名单";
  [0x0133] = "PGConfig（密保配置）";
  [0x0134] = "获取好友/群列表";
  [0x0195] = "获取群分组信息";
  [0x01A4] = "加入黑名单";
  [0x01A5] = "查询黑名单";
  [0x01BB] = "Key交互";
  [0x03FC] = "消息撤回";
  [0x0825] = "Ping（服务器探询）";
  [0x0827] = "快速登录";
  [0x0828] = "PreLogin（令牌获取）";
  [0x0836] = "GetTGTGT（登陆验证）";
  };

return
  setmetatable( CsCmdNo,
    {
    __newindex =  function()
        return error "TXSSO2 CsCmdNo不允许修改";
      end
    }
    );